## DataFrames

In [3]:
## Bunch of series objects

In [5]:
import numpy as np
import pandas as pd

In [7]:
from numpy.random import randn

In [9]:
df = pd.DataFrame(randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])  ##index --> Rows

In [11]:
df

          W         X         Y         Z
A -1.025332  0.698729 -1.233614 -1.225015
B -0.297306  0.155836  0.876911 -0.665829
C  0.563733 -1.474903  0.507534  1.362841
D  0.499538 -1.538249 -0.409523  0.915616
E  1.340916  0.297593 -0.443420 -0.370344

## Selection And Indexing

In [16]:
df['W']

A   -1.025332
B   -0.297306
C    0.563733
D    0.499538
E    1.340916
Name: W, dtype: float64

In [18]:
type(df['W'])

pandas.core.series.Series

In [20]:
df[['W','X']]

          W         X
A -1.025332  0.698729
B -0.297306  0.155836
C  0.563733 -1.474903
D  0.499538 -1.538249
E  1.340916  0.297593

In [22]:

## SQL Syntax (Not recommended)
df.W

A   -1.025332
B   -0.297306
C    0.563733
D    0.499538
E    1.340916
Name: W, dtype: float64

In [24]:
df

          W         X         Y         Z
A -1.025332  0.698729 -1.233614 -1.225015
B -0.297306  0.155836  0.876911 -0.665829
C  0.563733 -1.474903  0.507534  1.362841
D  0.499538 -1.538249 -0.409523  0.915616
E  1.340916  0.297593 -0.443420 -0.370344

In [26]:
df['NewColumn']=df['W']+df['X']

In [28]:
df

          W         X         Y         Z  NewColumn
A -1.025332  0.698729 -1.233614 -1.225015  -0.326603
B -0.297306  0.155836  0.876911 -0.665829  -0.141470
C  0.563733 -1.474903  0.507534  1.362841  -0.911170
D  0.499538 -1.538249 -0.409523  0.915616  -1.038712
E  1.340916  0.297593 -0.443420 -0.370344   1.638508

In [30]:
## Removing columns -- > Columns remove -- axis = 1, rows remove -- axis = 0

In [32]:
df.drop('NewColumn',axis=1)

          W         X         Y         Z
A -1.025332  0.698729 -1.233614 -1.225015
B -0.297306  0.155836  0.876911 -0.665829
C  0.563733 -1.474903  0.507534  1.362841
D  0.499538 -1.538249 -0.409523  0.915616
E  1.340916  0.297593 -0.443420 -0.370344

In [34]:
df

          W         X         Y         Z  NewColumn
A -1.025332  0.698729 -1.233614 -1.225015  -0.326603
B -0.297306  0.155836  0.876911 -0.665829  -0.141470
C  0.563733 -1.474903  0.507534  1.362841  -0.911170
D  0.499538 -1.538249 -0.409523  0.915616  -1.038712
E  1.340916  0.297593 -0.443420 -0.370344   1.638508

In [36]:
df.drop('NewColumn',axis=1,inplace=True)

In [38]:
df

          W         X         Y         Z
A -1.025332  0.698729 -1.233614 -1.225015
B -0.297306  0.155836  0.876911 -0.665829
C  0.563733 -1.474903  0.507534  1.362841
D  0.499538 -1.538249 -0.409523  0.915616
E  1.340916  0.297593 -0.443420 -0.370344

In [40]:
df.drop('E',axis = 0)

          W         X         Y         Z
A -1.025332  0.698729 -1.233614 -1.225015
B -0.297306  0.155836  0.876911 -0.665829
C  0.563733 -1.474903  0.507534  1.362841
D  0.499538 -1.538249 -0.409523  0.915616

In [42]:
df

          W         X         Y         Z
A -1.025332  0.698729 -1.233614 -1.225015
B -0.297306  0.155836  0.876911 -0.665829
C  0.563733 -1.474903  0.507534  1.362841
D  0.499538 -1.538249 -0.409523  0.915616
E  1.340916  0.297593 -0.443420 -0.370344

In [44]:
df.drop('E',axis = 0,inplace= True)

In [46]:
df

          W         X         Y         Z
A -1.025332  0.698729 -1.233614 -1.225015
B -0.297306  0.155836  0.876911 -0.665829
C  0.563733 -1.474903  0.507534  1.362841
D  0.499538 -1.538249 -0.409523  0.915616

In [48]:
## Selecting Columns
df['W']

A   -1.025332
B   -0.297306
C    0.563733
D    0.499538
Name: W, dtype: float64

In [50]:
## Rows selection
df.loc['A']

W   -1.025332
X    0.698729
Y   -1.233614
Z   -1.225015
Name: A, dtype: float64

In [52]:
type(df.loc['A'])

pandas.core.series.Series

In [54]:
## Specific value based on rows and column headers
df.loc['A','W']

-1.0253324914822057

In [56]:
## Specific value based on rows and column indexes
df.iloc[2,3] # index always starts from zero for both columns and rows

1.3628408154439078

In [58]:
# df.iloc[rowIndex,columnIndex]

## Conditional Selection

In [61]:
df

          W         X         Y         Z
A -1.025332  0.698729 -1.233614 -1.225015
B -0.297306  0.155836  0.876911 -0.665829
C  0.563733 -1.474903  0.507534  1.362841
D  0.499538 -1.538249 -0.409523  0.915616

In [63]:
df>0

       W      X      Y      Z
A  False   True  False  False
B  False   True   True  False
C   True  False   True   True
D   True  False  False   True

In [65]:
df[df>0]

          W         X         Y         Z
A       NaN  0.698729       NaN       NaN
B       NaN  0.155836  0.876911       NaN
C  0.563733       NaN  0.507534  1.362841
D  0.499538       NaN       NaN  0.915616

In [67]:
df[df['W']>0]

          W         X         Y         Z
C  0.563733 -1.474903  0.507534  1.362841
D  0.499538 -1.538249 -0.409523  0.915616

In [69]:
df

          W         X         Y         Z
A -1.025332  0.698729 -1.233614 -1.225015
B -0.297306  0.155836  0.876911 -0.665829
C  0.563733 -1.474903  0.507534  1.362841
D  0.499538 -1.538249 -0.409523  0.915616

In [75]:
df[(df['W']>0) & (df['Y']<0)]

          W         X         Y         Z
D  0.499538 -1.538249 -0.409523  0.915616